robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/lowlevel/stm32hal/cubemx/psc/Src/I2C_Multi_SDA.c
/******************************************************************************
 * I2C_Multi_SDA.c
 *
 *
 * Created on: Jan 18, 2016
 * Board: SSI
 * Author: andrea mura
 *
 * Description: This file contains the functions for sending data from a non standard I2C
 * 		with 2 SCK lines and 8 SDA lines
 *
 * Modified:
 *
 ******************************************************************************/

//---------------------------------
//Function prototypes
//---------------------------------
#include "main.h"
#include "stm32l4xx_hal.h"
#include "stm32l4xx_ll_gpio.h"
#include "I2C_Multi_SDA.h"
//---------------------------------
//Function prototypes
//---------------------------------
#define I2C_WR		0x00
#define I2C_RD		0x01
#define	ACK			0
#define	NACK		1
unsigned int I2Cbit=5; //the duration of a bit 10 is about 28Khz, 1 is about 500KHz


#define	MCO_0_on		HAL_GPIO_WritePin(I2C_CLK_GPIO_Port, I2C_CLK_Pin, GPIO_PIN_SET);
#define	MCO_0_off   HAL_GPIO_WritePin(I2C_CLK_GPIO_Port, I2C_CLK_Pin, GPIO_PIN_RESET);

#define DO_0on      HAL_GPIO_WritePin(I2C_SDA0_GPIO_Port, I2C_SDA0_Pin, GPIO_PIN_SET);\
                    HAL_GPIO_WritePin(I2C_SDA1_GPIO_Port, I2C_SDA1_Pin, GPIO_PIN_SET);\
                    HAL_GPIO_WritePin(I2C_SDA2_GPIO_Port, I2C_SDA2_Pin, GPIO_PIN_SET);\
                    HAL_GPIO_WritePin(I2C_SDA3_GPIO_Port, I2C_SDA3_Pin, GPIO_PIN_SET);

#define DO_0off     HAL_GPIO_WritePin(I2C_SDA0_GPIO_Port, I2C_SDA0_Pin, GPIO_PIN_RESET);\
                    HAL_GPIO_WritePin(I2C_SDA1_GPIO_Port, I2C_SDA1_Pin, GPIO_PIN_RESET);\
                    HAL_GPIO_WritePin(I2C_SDA2_GPIO_Port, I2C_SDA2_Pin, GPIO_PIN_RESET);\
                    HAL_GPIO_WritePin(I2C_SDA3_GPIO_Port, I2C_SDA3_Pin, GPIO_PIN_RESET);

#define DE_0input   DO_0on;\
                    LL_GPIO_SetPinMode(I2C_SDA0_GPIO_Port, I2C_SDA0_Pin, LL_GPIO_MODE_INPUT);\
                    LL_GPIO_SetPinMode(I2C_SDA1_GPIO_Port, I2C_SDA1_Pin, LL_GPIO_MODE_INPUT);\
                    LL_GPIO_SetPinMode(I2C_SDA2_GPIO_Port, I2C_SDA2_Pin, LL_GPIO_MODE_INPUT);\
                    LL_GPIO_SetPinMode(I2C_SDA3_GPIO_Port, I2C_SDA3_Pin, LL_GPIO_MODE_INPUT);\
                    LL_GPIO_SetPinPull(I2C_SDA0_GPIO_Port, I2C_SDA0_Pin, LL_GPIO_PULL_UP);\
                    LL_GPIO_SetPinPull(I2C_SDA1_GPIO_Port, I2C_SDA1_Pin, LL_GPIO_PULL_UP);\
                    LL_GPIO_SetPinPull(I2C_SDA2_GPIO_Port, I2C_SDA2_Pin, LL_GPIO_PULL_UP);\
                    LL_GPIO_SetPinPull(I2C_SDA3_GPIO_Port, I2C_SDA3_Pin, LL_GPIO_PULL_UP);

#define DE_0output  LL_GPIO_SetPinMode(I2C_SDA0_GPIO_Port, I2C_SDA0_Pin, LL_GPIO_MODE_OUTPUT);\
                    LL_GPIO_SetPinMode(I2C_SDA1_GPIO_Port, I2C_SDA1_Pin, LL_GPIO_MODE_OUTPUT);\
                    LL_GPIO_SetPinMode(I2C_SDA2_GPIO_Port, I2C_SDA2_Pin, LL_GPIO_MODE_OUTPUT);\
                    LL_GPIO_SetPinMode(I2C_SDA3_GPIO_Port, I2C_SDA3_Pin, LL_GPIO_MODE_OUTPUT);\
                    LL_GPIO_SetPinOutputType(I2C_SDA0_GPIO_Port, I2C_SDA0_Pin, LL_GPIO_OUTPUT_PUSHPULL);\
                    LL_GPIO_SetPinOutputType(I2C_SDA1_GPIO_Port, I2C_SDA1_Pin, LL_GPIO_OUTPUT_PUSHPULL);\
                    LL_GPIO_SetPinOutputType(I2C_SDA2_GPIO_Port, I2C_SDA2_Pin, LL_GPIO_OUTPUT_PUSHPULL);\
                    LL_GPIO_SetPinOutputType(I2C_SDA3_GPIO_Port, I2C_SDA3_Pin, LL_GPIO_OUTPUT_PUSHPULL);

#define MCE_0input  LL_GPIO_SetPinMode(I2C_CLK_GPIO_Port, I2C_CLK_Pin, LL_GPIO_MODE_INPUT);\
                    LL_GPIO_SetPinOutputType(I2C_CLK_GPIO_Port, I2C_CLK_Pin, LL_GPIO_PULL_UP);

#define MCE_0output LL_GPIO_SetPinMode(I2C_CLK_GPIO_Port, I2C_CLK_Pin, LL_GPIO_MODE_OUTPUT);\
                    LL_GPIO_SetPinOutputType(I2C_CLK_GPIO_Port, I2C_CLK_Pin, LL_GPIO_OUTPUT_PUSHPULL);


//======================================= I2C interface initialization ========================

//TRISFbits.TRISF6=0; // CLK in I2C mode

#define I2CCLKPW		1             //This value define the CLK frequency
#define REGISTER_LENGTH	16

//External functions
//==================



static unsigned char ReceivedByte[4] = { 0, 0, 0, 0 };

void Wait(unsigned int cycles) {

	while (cycles>0)
	{
		cycles--;
	//HAL_GPIO_TogglePin(GPIOA,GPIO_PIN_5);
	//	GPIOA->ODR ^= GPIO_PIN_5; //da aggiungere se si ottimizza
	}

}

void I2C_Multi_SDA_deInit(unsigned char Channel) {
  MCE_0output
  DE_0output
  MCO_0_off
  DO_0off
}

void I2C_Multi_SDA_Init(unsigned char Channel) {
  MCE_0output
  DE_0output
}

void I2C_Multi_SDA_test(unsigned char Channel) {
  DE_0output
  MCO_0_on
  Wait(I2Cbit);           // Wait(I2Cbit);
  MCO_0_off
  DO_0on
  Wait(I2Cbit);           //Wait(I2Cbit);
  MCO_0_on
  DO_0on
  Wait(I2Cbit);           //Wait(I2Cbit);
  MCO_0_off
  DO_0off
  Wait(I2Cbit);           //Wait(I2Cbit);
}

//---------------------------------
//WriteAD7147ViaI2C()
//---------------------------------
//Function that writes one byte via the I2C port . It sends first the device
//address including the write bit, then the register address and finally the
//data. The function returns "1" if successfull otherwise "0".
//--------------------------------------------------------------------------------
unsigned char WriteByteViaI2C(unsigned char Channel,
		unsigned char DeviceAddress, const unsigned char RegisterStartAddress,
		unsigned char DataBuffer) {

	unsigned char ByteAddress;
	unsigned char AcknError;
	unsigned char DeviceAddressHeader;
	AcknError = 1; //No error on initialisation

	//Add the write bit to the device address
	DeviceAddressHeader = DeviceAddress << 1 | I2C_WR;
	//Split the address in two bytes
	ByteAddress = RegisterStartAddress & 0xFF;

	//Start the I2C transfer
	InitialiseI2CMaster(Channel);
	StartI2CMaster(Channel);
	//Send device address
	if (!SendByteI2CMaster(Channel, DeviceAddressHeader)) {
		//Send register address if the acknowledgement is there
		if (!SendByteI2CMaster(Channel, ByteAddress)) {
			SendByteI2CMaster(Channel, DataBuffer);

			StopI2CMaster(Channel);
			AcknError = 0;
		} else //No acknowledgement was found therefore send the stop condition
		{
			StopI2CMaster(Channel);
			AcknError = 0;
		}
	} else //No acknowledgement was found therefore send the stop condition
	{
		StopI2CMaster(Channel);
		AcknError = 0;
	}
	return (AcknError);
}

//---------------------------------
//WriteAD7147ViaI2C()
//---------------------------------
//Function that writes  via the I2C port pair of 16 bits data. It sends first the device
//address including the write bit, then the register address and finally the
//data. The function returns "1" if successfull otherwise "0".
//--------------------------------------------------------------------------------
unsigned char WriteViaI2C(unsigned char Channel, unsigned char DeviceAddress,
		const unsigned int RegisterStartAddress,
		const unsigned char NumberOfRegistersToWrite, unsigned int *DataBuffer,
		const unsigned int OffsetInBuffer) {
	unsigned int DataToWrite;
	unsigned char LowByteAddress, HighByteAddress;
	unsigned char LowByteData, HighByteData;
	unsigned char r, AcknError;
	unsigned char DeviceAddressHeader;

	AcknError = 1; //No error on initialisation

	//Add the write bit to the device address
	DeviceAddressHeader = DeviceAddress << 1 | I2C_WR;
	//Split the address in two bytes
	HighByteAddress = (RegisterStartAddress & 0xFF00) >> 8;
	LowByteAddress = RegisterStartAddress & 0x00FF;

	//Start the I2C transfer
	InitialiseI2CMaster(Channel);
	StartI2CMaster(Channel);
	//Send device address
	if (!SendByteI2CMaster(Channel, DeviceAddressHeader)) {
		//Send register address if the acknowledgement is there
		if (!SendByteI2CMaster(Channel, HighByteAddress)) {
			if (!SendByteI2CMaster(Channel, LowByteAddress)) {
				//Perform block write
				for (r = 0; r < NumberOfRegistersToWrite; r++) {
					DataToWrite = DataBuffer[OffsetInBuffer + r];
					LowByteData = DataToWrite & 0x00FF;
					HighByteData = (DataToWrite & 0xFF00) >> 8;
					if (!SendByteI2CMaster(Channel, HighByteData)) {
						SendByteI2CMaster(Channel, LowByteData);
					} else //No acknowledgement was found therefore send the stop condition
					{
						StopI2CMaster(Channel);
						AcknError = 0;
					}
				}
				//Stop transfer
				StopI2CMaster(Channel);
			} else //No acknowledgement was found therefore send the stop condition
			{
				StopI2CMaster(Channel);
				AcknError = 0;
			}
		} else //No acknowledgement was found therefore send the stop condition
		{
			StopI2CMaster(Channel);
			AcknError = 0;
		}
	} else //No acknowledgement was found therefore send the stop condition
	{
		StopI2CMaster(Channel);
		AcknError = 0;
	}
	return (AcknError);
}

//---------------------------------
//WriteAD7147ViaI2C()
//---------------------------------
//Function that writes  via the I2C port pair of 16 bits data. It sends first the device
//address including the write bit, then the register address and finally the
//data. The function returns "1" if successfull otherwise "0".
//--------------------------------------------------------------------------------
unsigned char WriteViaI2C_onSdaX(unsigned char Channel, i2c_sda_num_t sdaNum,
		unsigned char DeviceAddress, const unsigned int RegisterStartAddress,
		const unsigned char NumberOfRegistersToWrite, unsigned int *DataBuffer,
		const unsigned int OffsetInBuffer) {
	unsigned int DataToWrite;
	unsigned char LowByteAddress, HighByteAddress;
	unsigned char LowByteData, HighByteData;
	unsigned char r, AcknError;
	unsigned char DeviceAddressHeader;

	AcknError = 1; //No error on initialisation

	//Add the write bit to the device address
	DeviceAddressHeader = DeviceAddress << 1 | I2C_WR;
	//Split the address in two bytes
	HighByteAddress = (RegisterStartAddress & 0xFF00) >> 8;
	LowByteAddress = RegisterStartAddress & 0x00FF;

	//Start the I2C transfer
	InitialiseI2CMaster(Channel);
	StartI2CMaster_onSdaX(Channel, sdaNum);
	//Send device address
	if (!SendByteI2CMaster_onSdaX(Channel, sdaNum, DeviceAddressHeader)) {
		//Send register address if the acknowledgement is there
		if (!SendByteI2CMaster_onSdaX(Channel, sdaNum, HighByteAddress)) {
			if (!SendByteI2CMaster_onSdaX(Channel, sdaNum, LowByteAddress)) {
				//Perform block write
				for (r = 0; r < NumberOfRegistersToWrite; r++) {
					DataToWrite = DataBuffer[OffsetInBuffer + r];
					LowByteData = DataToWrite & 0x00FF;
					HighByteData = (DataToWrite & 0xFF00) >> 8;
					if (!SendByteI2CMaster_onSdaX(Channel, sdaNum,
							HighByteData)) {
						SendByteI2CMaster_onSdaX(Channel, sdaNum, LowByteData);
					} else //No acknowledgement was found therefore send the stop condition
					{
						StopI2CMaster_onSdaX(Channel, sdaNum);
						AcknError = 0;
					}
				}
				//Stop transfer
				StopI2CMaster_onSdaX(Channel, sdaNum);
			} else //No acknowledgement was found therefore send the stop condition
			{
				StopI2CMaster_onSdaX(Channel, sdaNum);
				AcknError = 0;
			}
		} else //No acknowledgement was found therefore send the stop condition
		{
			StopI2CMaster_onSdaX(Channel, sdaNum);
			AcknError = 0;
		}
	} else //No acknowledgement was found therefore send the stop condition
	{
		StopI2CMaster_onSdaX(Channel, sdaNum);
		AcknError = 0;
	}
	return (AcknError);
}

