robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/lowlevel/stm32hal/cubemx/psc/Src/I2C_Multi_SDA.c
unsigned char WriteByteI2C_onSdaX(unsigned char Channel, i2c_sda_num_t sdaNum,
        unsigned char DeviceAddress, const unsigned int RegisterStartAddress,
        const unsigned char NumberOfRegistersToWrite, unsigned int *DataBuffer,
        const unsigned int OffsetInBuffer) {
    unsigned int DataToWrite;
    unsigned char LowByteAddress, HighByteAddress;
    unsigned char LowByteData, HighByteData;
    unsigned char r, AcknError;
    unsigned char DeviceAddressHeader;

    AcknError = 1; //No error on initialisation

    //Add the write bit to the device address
    DeviceAddressHeader = DeviceAddress << 1 | I2C_WR;
    //Start the I2C transfer
    InitialiseI2CMaster(Channel);
    StartI2CMaster_onSdaX(Channel, sdaNum);
    //Send device address
    if (!SendByteI2CMaster_onSdaX(Channel, sdaNum, DeviceAddressHeader)) {
        //Send register address if the acknowledgement is there
            if (!SendByteI2CMaster_onSdaX(Channel, sdaNum, RegisterStartAddress)) {
                //Perform block write
                for (r = 0; r < NumberOfRegistersToWrite; r++) {
                    DataToWrite = DataBuffer[OffsetInBuffer + r];
                    LowByteData = DataToWrite & 0x00FF;
                    if (!SendByteI2CMaster_onSdaX(Channel, sdaNum, LowByteData)){
                    } else //No acknowledgement was found therefore send the stop condition
                    {
                        StopI2CMaster_onSdaX(Channel, sdaNum);
                        AcknError = 0;
                    }
                }
                //Stop transfer
                StopI2CMaster_onSdaX(Channel, sdaNum);
            } else //No acknowledgement was found therefore send the stop condition
            {
                StopI2CMaster_onSdaX(Channel, sdaNum);
                AcknError = 0;
            }
    } else //No acknowledgement was found therefore send the stop condition
    {
        StopI2CMaster_onSdaX(Channel, sdaNum);
        AcknError = 0;
    }
    return (AcknError);
}





//---------------------------------
//ReadByteViaI2C()
//---------------------------------
//Function that reads a Byte from  via the I2C port. It sends first the device
//address including the write bit, then the register address and finally reads data
//back. The function returns "1" if successfull otherwise "0". If an error occurs,
//Then the stop condition is sent.
//--------------------------------------------------------------------------------
unsigned char ReadByteViaI2C(unsigned char Channel, unsigned char SDAnum,
		unsigned char DeviceAddress, const unsigned char RegisterAddress,
		unsigned char *DataBuffer) {

	unsigned char AcknError;
	unsigned char SDA_number = SDAnum; //for the palm
	unsigned char DeviceAddressHeader;

	AcknError = 1; //No error on initialisation

	//Add the write bit to the device address
	DeviceAddressHeader = DeviceAddress << 1 | I2C_WR; //qui ci vuole I2C_WR o RD secondo me RD

	//Start the I2C transfer
	InitialiseI2CMaster(Channel);
	StartI2CMaster(Channel);

	//Send device address
	if (!SendByteI2CMaster(Channel, DeviceAddressHeader)) {
		//Send register address
		if (!SendByteI2CMaster(Channel, RegisterAddress)) {
			//Send the repeated start
			StartI2CMaster(Channel);
			//Send device address again changing the Rd/Wr bit
			DeviceAddressHeader = DeviceAddress << 1 | I2C_RD;
			if (!SendByteI2CMaster(Channel, DeviceAddressHeader)) {
				//Perform block read, but first,we need to know if we must send an ACKN or a NACK

				ReceiveByteI2CMaster(Channel, NACK);
				*DataBuffer = ReceivedByte[SDA_number];
				//Stop transfer
				StopI2CMaster(Channel);
			} else //No acknowledgement was found therefore send the stop condition
			{
				StopI2CMaster(Channel);
				AcknError = 0;
			}
		} else //No acknowledgement was found therefore send the stop condition
		{
			StopI2CMaster(Channel);
			AcknError = 0;
		}
	} else //No acknowledgement was found therefore send the stop condition
	{
		StopI2CMaster(Channel);
		AcknError = 0;
	}
	return (AcknError);
}
//---------------------------------
//ReadViaI2C()
//---------------------------------
//Function that reads from  via the I2C port. It sends first the device
//address including the write bit, then the register address and finally reads data
//back. The function returns "1" if successfull otherwise "0". If an error occurs,
//Then the stop condition is sent.
//--------------------------------------------------------------------------------
unsigned char ReadViaI2C(unsigned char Channel, unsigned char DeviceAddress,
		const unsigned int RegisterStartAddress,
		const unsigned char NumberOfRegistersToRead, unsigned int *DataBuffer1,
		unsigned int *DataBuffer2, unsigned int *DataBuffer3,
		unsigned int *DataBuffer4, const unsigned int OffsetInBuffer) {
	unsigned char LowByteAddress, HighByteAddress;
	unsigned char LowByteData[4], HighByteData[4];
	unsigned char r, AcknError;
	unsigned char DeviceAddressHeader;

	AcknError = 1; //No error on initialisation

	//Add the write bit to the device address
	DeviceAddressHeader = DeviceAddress << 1 | I2C_WR; //qui ci vuole I2C_WR o RD secondo me RD
	//Split the address in two bytes
	HighByteAddress = (RegisterStartAddress & 0xFF00) >> 8;
	LowByteAddress = RegisterStartAddress & 0x00FF;

	//Start the I2C transfer
	InitialiseI2CMaster(Channel);
	StartI2CMaster(Channel);

	//Send device address
	if (!SendByteI2CMaster(Channel, DeviceAddressHeader)) {
		//Send register address
		if (!SendByteI2CMaster(Channel, HighByteAddress)) {
			if (!SendByteI2CMaster(Channel, LowByteAddress)) {
				//Send the repeated start
				StartI2CMaster(Channel);
				//Send device address again changing the Rd/Wr bit
				DeviceAddressHeader = DeviceAddress << 1 | I2C_RD;
				if (!SendByteI2CMaster(Channel, DeviceAddressHeader)) {
					//Perform block read, but first,we need to know if we must send an ACKN or a NACK
					if (NumberOfRegistersToRead == 1) {
						ReceiveByteI2CMaster(Channel, ACK);
						HighByteData[0] = ReceivedByte[0];
						HighByteData[1] = ReceivedByte[1];
						HighByteData[2] = ReceivedByte[2];
						HighByteData[3] = ReceivedByte[3];

