robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/lowlevel/stm32hal/cubemx/psc/Src/I2C_Multi_SDA.c
						ReceiveByteI2CMaster(Channel, NACK);
						LowByteData[0] = ReceivedByte[0];
						LowByteData[1] = ReceivedByte[1];
						LowByteData[2] = ReceivedByte[2];
						LowByteData[3] = ReceivedByte[3];

						DataBuffer1[OffsetInBuffer] = ((HighByteData[0] & 0xFF)
								<< 8) | LowByteData[0];

						DataBuffer2[OffsetInBuffer] = ((HighByteData[1] & 0xFF)
								<< 8) | LowByteData[1];

						DataBuffer3[OffsetInBuffer] = ((HighByteData[2] & 0xFF)
								<< 8) | LowByteData[2];

						DataBuffer4[OffsetInBuffer] = ((HighByteData[3] & 0xFF)
								<< 8) | LowByteData[3];

					} else {
						for (r = 0; r < (NumberOfRegistersToRead - 1); r++) {
							ReceiveByteI2CMaster(Channel, ACK);
							HighByteData[0] = ReceivedByte[0];
							HighByteData[1] = ReceivedByte[1];
							HighByteData[2] = ReceivedByte[2];
							HighByteData[3] = ReceivedByte[3];

							ReceiveByteI2CMaster(Channel, ACK);
							LowByteData[0] = ReceivedByte[0];
							LowByteData[1] = ReceivedByte[1];
							LowByteData[2] = ReceivedByte[2];
							LowByteData[3] = ReceivedByte[3];

							DataBuffer1[OffsetInBuffer + r] = ((HighByteData[0]
									& 0xFF) << 8) | LowByteData[0];

							DataBuffer2[OffsetInBuffer + r] = ((HighByteData[1]
									& 0xFF) << 8) | LowByteData[1];

							DataBuffer3[OffsetInBuffer + r] = ((HighByteData[2]
									& 0xFF) << 8) | LowByteData[2];

							DataBuffer4[OffsetInBuffer + r] = ((HighByteData[3]
									& 0xFF) << 8) | LowByteData[3];

						}
						//Do the last read sending the NACK
						ReceiveByteI2CMaster(Channel, ACK);
						HighByteData[0] = ReceivedByte[0];
						HighByteData[1] = ReceivedByte[1];
						HighByteData[2] = ReceivedByte[2];
						HighByteData[3] = ReceivedByte[3];

						ReceiveByteI2CMaster(Channel, NACK);
						LowByteData[0] = ReceivedByte[0];
						LowByteData[1] = ReceivedByte[1];
						LowByteData[2] = ReceivedByte[2];
						LowByteData[3] = ReceivedByte[3];

						DataBuffer1[OffsetInBuffer + NumberOfRegistersToRead - 1] =
								((HighByteData[0] & 0xFF) << 8)
										| LowByteData[0];

						DataBuffer2[OffsetInBuffer + NumberOfRegistersToRead - 1] =
								((HighByteData[1] & 0xFF) << 8)
										| LowByteData[1];

						DataBuffer3[OffsetInBuffer + NumberOfRegistersToRead - 1] =
								((HighByteData[2] & 0xFF) << 8)
										| LowByteData[2];

						DataBuffer4[OffsetInBuffer + NumberOfRegistersToRead - 1] =
								((HighByteData[3] & 0xFF) << 8)
										| LowByteData[3];

					}
					//Stop transfer
					StopI2CMaster(Channel);
				} else //No acknowledgement was found therefore send the stop condition
				{
					StopI2CMaster(Channel);
					AcknError = 0;
				}
			} else //No acknowledgement was found therefore send the stop condition
			{
				StopI2CMaster(Channel);
				AcknError = 0;
			}
		} else //No acknowledgement was found therefore send the stop condition
		{
			StopI2CMaster(Channel);
			AcknError = 0;
		}
	} else //No acknowledgement was found therefore send the stop condition
	{
		StopI2CMaster(Channel);
		AcknError = 0;
	}
	return (AcknError);
}

/********************************************************************************************************/
/*** Low level functions, do not change anything below this line, however check the valid clock level ***/
/********************************************************************************************************/
//ReadViaI2C()
//---------------------------------
//Function that reads from  via the I2C port. It sends first the device
//address including the write bit, then the register address and finally reads data
//back. The function returns "1" if successfull otherwise "0". If an error occurs,
//Then the stop condition is sent.
//--------------------------------------------------------------------------------
unsigned char ReadBurstViaI2C(unsigned char Channel, unsigned char SDAnum,
		unsigned char DeviceAddress, const unsigned int RegisterStartAddress,
		const unsigned char NumberOfRegistersToRead, unsigned int *DataBuffer) {
	unsigned char ByteAddress;
	unsigned char LowByteData, HighByteData;
	unsigned char r, AcknError;
	unsigned char SDA_number = SDAnum;
	unsigned char DeviceAddressHeader;

	AcknError = 1; //No error on initialisation

	//Add the write bit to the device address
	DeviceAddressHeader = DeviceAddress << 1 | I2C_WR; //qui ci vuole I2C_WR o RD secondo me RD

	ByteAddress = RegisterStartAddress & 0x00FF;

	//Start the I2C transfer
	InitialiseI2CMaster(Channel);
	StartI2CMaster(Channel);

	//Send device address
	if (!SendByteI2CMaster(Channel, DeviceAddressHeader)) {
		//Send register address

		if (!SendByteI2CMaster(Channel, ByteAddress)) {
			//Send the repeated start
			StartI2CMaster(Channel);
			//Send device address again changing the Rd/Wr bit
			DeviceAddressHeader = DeviceAddress << 1 | I2C_RD;
			if (!SendByteI2CMaster(Channel, DeviceAddressHeader)) {
				//Perform block read, but first,we need to know if we must send an ACKN or a NACK
				if (NumberOfRegistersToRead == 1) {
					ReceiveByteI2CMaster(Channel, ACK);
					HighByteData = ReceivedByte[SDA_number];
					;

					ReceiveByteI2CMaster(Channel, NACK);
					LowByteData = ReceivedByte[SDA_number];
					;

					DataBuffer[0] = ((HighByteData & 0xFF) << 8) | LowByteData;

				} else {
					for (r = 0; r < (NumberOfRegistersToRead - 1); r++) {
						ReceiveByteI2CMaster(Channel, ACK);
						HighByteData = ReceivedByte[SDA_number];
						;

						ReceiveByteI2CMaster(Channel, ACK);
						LowByteData = ReceivedByte[SDA_number];
						;

						DataBuffer[r] = ((HighByteData & 0xFF) << 8)
								| LowByteData;

					}
					//Do the last read sending the NACK
					ReceiveByteI2CMaster(Channel, ACK);
					HighByteData = ReceivedByte[SDA_number];
					;

					ReceiveByteI2CMaster(Channel, NACK);
					LowByteData = ReceivedByte[SDA_number];
					;

					DataBuffer[NumberOfRegistersToRead - 1] = ((HighByteData
							& 0xFF) << 8) | LowByteData;

				}
				//Stop transfer
				StopI2CMaster(Channel);
			} else //No acknowledgement was found therefore send the stop condition
			{
				StopI2CMaster(Channel);
				AcknError = 0;
			}
		} else //No acknowledgement was found therefore send the stop condition
		{
			StopI2CMaster(Channel);
			AcknError = 0;
		}

	} else //No acknowledgement was found therefore send the stop condition
	{
		StopI2CMaster(Channel);
		AcknError = 0;
	}
	return (AcknError);
}

//---------------------------------
//InitialiseI2CMaster();
//---------------------------------
//Function that configures the I2C port of the ADuC841 in master mode.
//--------------------------------------------------------------------------------

void InitialiseI2CMaster(unsigned char Channel) {
	switch (Channel) {
	case CH0: {
		MCE_0output
	}
		break;
	case CH1: {
		//MCE_1output;
	}
		break;
	}
	/*modificated
	 TRISFbits.TRISF6=0; //Write a "0" to CLK so that it becomes an output.
	 */
	//I2CCON = 0xA8;		//Master mode
}

//---------------------------------
//StartI2CMaster();
//---------------------------------
//Function that implements the start condition of the I2C protocol. The start
//condition consists in a falling edge on SDA when SCL is high.
//--------------------------------------------------------------------------------
void StartI2CMaster(unsigned char Channel) {
  DE_0input;
  Wait(I2Cbit);
  MCO_0_on
  //SCL high
  Wait(I2Cbit);
  Wait(I2Cbit);
  DE_0output
  //SDA as output
  DO_0off
  Wait(I2Cbit);
  MCO_0_off
  //SCL low
  Wait(I2Cbit);
}

