robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/lowlevel/stm32hal/cubemx/psc/Src/I2C_Multi_SDA.c
void SetSdaReg(i2c_sda_num_t sdaNum, unsigned char input) {
	switch (sdaNum) {
	case sda0: {
		//CLEAR_BIT(GPIOA->OTYPER, (GPIO_MODE_INPUT<<9)); //I2C_SDA0 as input
    LL_GPIO_SetPinMode(I2C_SDA0_GPIO_Port, I2C_SDA0_Pin, LL_GPIO_MODE_INPUT);
	}
		break;
	case sda1: {
		//CLEAR_BIT(GPIOA->OTYPER, (GPIO_MODE_INPUT<<8)); //SDA1 as input
    LL_GPIO_SetPinMode(I2C_SDA1_GPIO_Port, I2C_SDA1_Pin, LL_GPIO_MODE_INPUT);
	}
		break;
	case sda2: {
		//CLEAR_BIT(GPIOA->OTYPER, (GPIO_MODE_INPUT<<7)); //SDA2 as input
    LL_GPIO_SetPinMode(I2C_SDA2_GPIO_Port, I2C_SDA2_Pin, LL_GPIO_MODE_INPUT);
	}
		break;
	case sda3: {
		//CLEAR_BIT(GPIOA->OTYPER, (GPIO_MODE_INPUT<<6)); //SDA3 as input
    LL_GPIO_SetPinMode(I2C_SDA3_GPIO_Port, I2C_SDA3_Pin, LL_GPIO_MODE_INPUT);
	}
		break;
	};

}

void SetValReg(i2c_sda_num_t sdaNum, unsigned char val) {
	switch (sdaNum) {
	case sda0: {
		if (val == 0)
			//CLEAR_BIT(GPIOA->ODR, (1 << 9)); //I2C_SDA0
      HAL_GPIO_WritePin(I2C_SDA0_GPIO_Port, I2C_SDA0_Pin, GPIO_PIN_RESET);
		else
			//SET_BIT(GPIOA->ODR, (1 << 9)); //I2C_SDA0
      HAL_GPIO_WritePin(I2C_SDA0_GPIO_Port, I2C_SDA0_Pin, GPIO_PIN_SET);
	}
		break;
	case sda1: {
		if (val == 0)
			//CLEAR_BIT(GPIOA->ODR, (1 << 8)); //SDA1
      HAL_GPIO_WritePin(I2C_SDA1_GPIO_Port, I2C_SDA1_Pin, GPIO_PIN_RESET);
		else
			//SET_BIT(GPIOA->ODR, (1 << 8)); //SDA1
      HAL_GPIO_WritePin(I2C_SDA1_GPIO_Port, I2C_SDA1_Pin, GPIO_PIN_SET);
	}
		break;
	case sda2: {
		if (val == 0)
			//CLEAR_BIT(GPIOA->ODR, (1 << 7)); //SDA2
      HAL_GPIO_WritePin(I2C_SDA2_GPIO_Port, I2C_SDA2_Pin, GPIO_PIN_RESET);
		else
			//SET_BIT(GPIOA->ODR, (1 << 7)); //SDA2
      HAL_GPIO_WritePin(I2C_SDA2_GPIO_Port, I2C_SDA2_Pin, GPIO_PIN_SET);
	}
		break;
	case sda3: {
		if (val == 0)
			//CLEAR_BIT(GPIOA->ODR, (1 << 6)); //SDA3
      HAL_GPIO_WritePin(I2C_SDA3_GPIO_Port, I2C_SDA3_Pin, GPIO_PIN_RESET);
		else
			//SET_BIT(GPIOA->ODR, (1 << 6)); //SDA3
      HAL_GPIO_WritePin(I2C_SDA3_GPIO_Port, I2C_SDA3_Pin, GPIO_PIN_SET);
	}
		break;
	};

}

void StartI2CMaster_onSdaX(unsigned char Channel, i2c_sda_num_t sdaNum) {
	StartI2CMaster(Channel);
	/*
	switch (Channel) {
	case CH0: {
		//DE_0input;
		SetSdaReg(sdaNum, 1);

		Wait(I2Cbit);
		MCO_0_on
		//SCL high
		Wait(I2Cbit);

		Wait(I2Cbit);
		//DE_0output    //SDA as output
		SetSdaReg(sdaNum, 0);

		//DO_0off
		SetValReg(sdaNum, 0);
		Wait(I2Cbit);
		MCO_0_off
		//SCL low
		Wait(I2Cbit);
	}
		break;
	case CH1: {
		//DE_0input;
		SetSdaReg(sdaNum, 1);

		Wait(I2Cbit);
		MCO_1_on
		//SCL high
		Wait(I2Cbit);

		Wait(I2Cbit);
		//DE_0output    //SDA as output
		SetSdaReg(sdaNum, 0);

		//DO_0off
		SetValReg(sdaNum, 0);
		Wait(I2Cbit);
		MCO_1_off
		//SCL low
		Wait(I2Cbit);
	}
		break;
	}
*/
}

//---------------------------------
//StopI2CMaster();
//---------------------------------
//Function that implements the stop condition of the I2C protocol. The stop
//condition consists in a rising edge on SDA when SCL is high.
//--------------------------------------------------------------------------------
void StopI2CMaster(unsigned char Channel) {
		DE_0output
		//SDA as output
		DO_0off
		//SDA low
		Wait(I2Cbit);
		MCO_0_on
		//SCL high
		Wait(I2Cbit);    //Wait(I2Cbit);
		DE_0input
		//SDA as output
		//DO_0on   //SDA goes from low to high when SCL is already high,
		Wait(I2Cbit);//Wait(I2Cbit);
}

void StopI2CMaster_onSdaX(unsigned char Channel, i2c_sda_num_t sdaNum) {
    StopI2CMaster(Channel);
  
		//DE_0output  //SDA as output
		SetSdaReg(sdaNum, 0);
		//DO_0off  //SDA low
		SetValReg(sdaNum, 0);
		Wait(I2Cbit);
		MCO_0_on
		//SCL high
		Wait(I2Cbit);   //Wait(I2Cbit);
		//DE_0input  //SDA as output
		SetSdaReg(sdaNum, 1);
}

//---------------------------------
//SendByteI2CMaster();
//---------------------------------
//Function that sends a byte to the I2C port and then read the acknowledgement
//bit. If the acknowledgement is found, then the function returns "1" otherwise,
//it returns "0".
//--------------------------------------------------------------------------------
unsigned char SendByteI2CMaster(unsigned char Channel, unsigned char ByteToSend) {

	unsigned char i;
	unsigned char noack = 0;

		DE_0output
		//SDAs as output
		for (i = 8; i > 0; i--) {
			MCO_0_off
			//Reset SCL
			if (ByteToSend >> 7) {
				DO_0on;
			} else {
				DO_0off;
			}
			Wait(I2Cbit);
			MCO_0_on                     //Set SCL
			Wait(I2Cbit);
			Wait(I2Cbit);
			Wait(I2Cbit);
			MCO_0_off
			if (i == 1) {
				DE_0input
				;
			} else {                //Reset SCL
				Wait(I2Cbit);                //Wait(I2Cbit);
				ByteToSend <<= 1;         //Rotate data
			}
		}
		DO_0off
		Wait(I2Cbit);
		DE_0input //SDA becomes an input
		MCO_0_off
		//Reset SCL
		Wait(I2Cbit);                //Wait(I2Cbit);
		MCO_0_on                //Set SCL
		noack = 0;
		Wait(I2Cbit);                //Wait(I2Cbit);
		MCO_0_off
		DE_0output     //SDA becomes an output

	return (noack);
}

unsigned char SendByteI2CMaster_onSdaX(unsigned char Channel,
		i2c_sda_num_t sdaNum, unsigned char ByteToSend) {

	unsigned char i;
	unsigned char noack = 0;

		//DE_0output  //SDAs as output
		SetSdaReg(sdaNum, 0);

		for (i = 8; i > 0; i--) {
			MCO_0_off
			//Reset SCL
			/*@@@@@@@@@@@@
			 DO = ByteToSend >> 7;	//Send data to SDA pin
			 */
			if (ByteToSend >> 7) {
				//DO_0on;
				SetValReg(sdaNum, 1);
			} else {
				//DO_0off;
				SetValReg(sdaNum, 0);
			}
			Wait(I2Cbit); //Wait(0);

			//   Wait(I2Cbit);//Wait(I2Cbit);
			MCO_0_on
			//Set SCL
			Wait(I2Cbit);               //Wait(I2Cbit);
			Wait(I2Cbit);
			Wait(I2Cbit);
			MCO_0_off
			if (i == 1) {
				//DE_0input;
				SetSdaReg(sdaNum, 1);
			} else {                //Reset SCL
				Wait(I2Cbit);                //Wait(I2Cbit);
				ByteToSend <<= 1;         //Rotate data
			}
		}
		//DO_0off
		SetValReg(sdaNum, 0);

		//DE_0input                //SDA becomes an input
		SetSdaReg(sdaNum, 1);

		MCO_0_off
		//Reset SCL

		Wait(I2Cbit);              //Wait(I2Cbit);
		MCO_0_on              //Set SCL

		noack = 0;

		Wait(I2Cbit);              //Wait(I2Cbit);
		MCO_0_off
		//DE_0output   //SDA becomes an output
		SetSdaReg(sdaNum, 0);

