robotology/icub-firmware/emBODY/eBcode/arch-arm/libs/lowlevel/stm32hal/cubemx/psc/Src/I2C_Multi_SDA.c
	return (noack);
}

//---------------------------------
//ReceiveByteI2CMaster();
//---------------------------------
//Function that reads one byte from the I2C port. If we do continuous read,
//then the acknowledgement must be "0" excepted for the last read sequence which
//it must be "1".
//--------------------------------------------------------------------------------
void ReceiveByteI2CMaster(unsigned char Channel, unsigned char ackn) // changed bit with unsigned char
{
	unsigned char i;
		DE_0input
		//SDA becomes an input
		MCO_0_off
		//Reset SCL
		for (i = 8; i > 0; i--) {
			Wait(I2Cbit);    //Wait(I2Cbit);
			ReceivedByte[0] <<= 1;      //Rotate data
			ReceivedByte[1] <<= 1;      //Rotate data
			ReceivedByte[2] <<= 1;      //Rotate data
			ReceivedByte[3] <<= 1;      //Rotate data
			MCO_0_on                //Set SCL
//			ReceivedByte[0] |= (uint16_t) ((GPIOA->IDR & (1<<9))>>9);         //Read I2C_SDA0 -> data
//			ReceivedByte[1] |= ((GPIOA->IDR &(1<<8))>>8);       //Read SDA1 -> data
//			ReceivedByte[2] |= ((GPIOA->IDR &(1<<7))>>7);       //Read SDA2 -> data
//			ReceivedByte[3] |= ((GPIOA->IDR &(1<<6))>>6);       //Read SDA3 -> data
			ReceivedByte[0] |= HAL_GPIO_ReadPin(I2C_SDA0_GPIO_Port, I2C_SDA0_Pin);  //Read I2C_SDA0 -> data
			ReceivedByte[1] |= HAL_GPIO_ReadPin(I2C_SDA1_GPIO_Port, I2C_SDA1_Pin);  //Read I2C_SDA1 -> data
			ReceivedByte[2] |= HAL_GPIO_ReadPin(I2C_SDA2_GPIO_Port, I2C_SDA2_Pin);  //Read I2C_SDA2 -> data
			ReceivedByte[3] |= HAL_GPIO_ReadPin(I2C_SDA3_GPIO_Port, I2C_SDA3_Pin);  //Read I2C_SDA3 -> data
			Wait(I2Cbit);    //Wait(I2Cbit);
			MCO_0_off
			//Reset SCL
		}
		DE_0output
		//SDA becomes an output
		if (ackn == 1) {
			DO_0on
		} else
			DO_0off
		Wait(I2Cbit);               //Wait(I2Cbit);
		MCO_0_on
		//Set SCL
		Wait(I2Cbit);    //Wait(I2Cbit);
		MCO_0_off
		//Reset SCL

}




